
public enum City {

    АМСТЕРДАМ, АНТАЛИЯ, АНКАРА, АШХАБАД, АСТАНА, АФИНЫ, АРХАНГЕЛЬСК, АБАКАН, АБДЖАН, АВИНЬЕН, АГРА, АДЕЛАИДА, АДЫГЕЙ, АЗОВ,
    АКТЮБИНСК, АЛЕКСАНДРИЯ, АЛЕППО, АЛЖИР, АЛИКАНТЕ, АЛУПКА, АЛУШТА, АММАН, АМУРСК, АНАПА, АНГАРСК, АРЗАМАС, АРМАВИР,АЛМАТЫ,АНТВЕРПЕН,АРАМАВИР,
    АХТУБИНСК,
    БРАЗИЛИЯ, БАКУ, БЕЛГРАД, БАНГАЛОР, БАНКОГ, БИШКЕК, БРЕСТ, БАРАНОВИЧИ, БЕРЛИН, БОБРУЙСК,БАГДАД,БАРНАУЛ,БЕЙРУТ,БАТУМИ,БЕЛГОРОД,БЕРН,БОРИСОВ,
    ВЕНА, ВОЛКОВЫСК, ВИЛЬНЮС, ВАРШАВА, ВЕНЕЦИЯ, ВАТИКАН,ВИТЕБСК,ВАШИНГТОН,ВЛАДИВОСТОК,ВОЛГОГРАД,ВЛАДИКОВКАЗ,ВОРКУТА,
    ГРОДНО, ГОМЕЛЬ, ГДАНЬСК, ГААГА,

    ДАКАР, ДУБАЙ, ДНЕПР, ДУБЛИН, ДЕТРОЙТ, ДРЕЗДЕН, ДЮСЕЛЬДОРФ, ДУШАНБЕ,

    ЕКАТЕРИНБУРГ, ЕССЕНТУКИ, ЕРЕВАН, ЕЙСК, ЕВПАТОРИЯ, ЕЛАБУГА,

    ЖИТОМИР, ЖИТКОВИЧИ, ЖАБИНКА, ЖЛОБИН, ЖЕЛЕЗНОГОРС,

    ЗЕЛЕНОГРАД, ЗАГРЕБ, ЗАНЗИБАР, ЗАТОКА,

    ИЖЕВСК, ИВАНОВО, ИРКУТСК, ИСЛАМАБАД, ИРБИТ,

    ЙЕНА, ЙОРК,

    КИЕВ, КИШИНЕВ, КРУПКИ, КАБУЛ, КАМБЕРРА, КАИР, КАЛЕ, КАЛИНИНГРАД, КАНДАГАР, КАРАКАС, КАРДИФФ, КОРНУОЛ, КЕЛЬН, КРУМЛОВ, КРАКОВ,КУРСК,

    КРИЧЕВ,КАУНАС,КАЛИНКОВИЧИ,КИСЛОВОДСК,КРАСНОДАР,

    ЛИДА, ЛИПЕЦК, ЛИСАБОН, ЛЕЙПЦИГ, ЛЬВОВ, ЛЕОН, ЛИВЕРПУЛЬ, ЛИДС, ЛИЛЬ, ЛОНДОН, ЛУНИНЕЦ,

    МИНСК, МОСКВА, МАГАДАН, МИКАШЕВИЧИ, МАЛЬМЕ, МАНИЛА, МАРСЕЛЬ, МАХАЧКАЛА, МЕККА, МЕМФИС, МЕЛЬБУРН, МАСАЧУСЕС, МЕХИКО, МИЛУОКИ, МИЛАН, МЮНХЕН,

    МОГИЛЕВ,МАДРИД,

    НАГАСАКИ, НАРВА, НАШВИЛЛ, НЕМАН, НЮРБЕРГ, НИЖНЕВАРТОВСК, НИЦЦА, НОВГОРОД, НОВОПОЛОЦК,

    ОТТАВА, ОСЛО, ОРЕЛ, ОДЕССА, ОКСФОРД, ОМАХА, ОСТИН,

    ПОЛОЦК, ПИНСК, ПРАГА, ПАДУЯ, ПАЛАНГА, ПАРИЖ, ПАРМА, ПЕНЗА, ПЕРУДЖА, ПЕЧИ, ПИЗА, ПОЛТАВА, ПОТСДАМ, ПУШКИНО, ПХУКЕТ, ПЯТИГОРСК,

    РИМ, РИГА, РОСТОВ, РОТТЕРДАМ, РЕУТОВ, РЖЕВ, РЕКЬЯВИК, РИМИНИ, РОЧЕСТЕР, РОВНО, РАККА,

    СЛУЦК, СОЛИГОРСК, СВЕТЛОГОРСК, САМАРА, САНТЬЯГО, СЕВАСТОПОЛЬ, САРАНСК, САРАТОВ, СЕВИЛЬЯ, СЕУЛ, СИНЕДАД, СИЭТЛ, СМОЛЕНСК, СОФИЯ, СОЧИ, СПАРТА,

    ТБИЛИСИ, ТОМБОВ, ТАГАНРОГ, ТАШКЕНТ, ТЕГЕРАН, ТОКИО, ТОЛЬЯТТИ, ТОМСК, ТОРОНТО, ТУАПСЕ, ТУЛА,

    УФА, УТРЕХТ, УГЛИЧ, УЛЬЯНОВСК, УХТА,

    ФЛОРЕНЦИЯ, ФИЛАДЕЛЬФИЯ, ФИНИКС,ФЕОДОСИЯ,

    ХАБАРОВС, ХАРБИН, ХАРЛЕМ, ХАСАВЮРТ, ХЕЛЬСИНКИ,

    ЦЮРИХ, ЦЕРМАТ,

    ЫСПАРТА,ЫБ,ЫЙВАН,

    ЧЕБОКСАРЫ, ЧЕЛЯБИНСК, ЧИКАГО, ЧЕРКАССЫ, ЧКАЛОВСК,

    ШАНХАЙ, ШЕФФИЛД,

    ЩЮЧИН, ЩЕЛКОВО,

    ЭДИНБУРГ, ЭЛИСТА,ЭНГЕЛЬС,

    ЮТА, ЮРМАЛА, ЮХНОВ,

    ЯЛТА, ЯКУТСК
}
